tutorials/flowOverCylinder/ibCylinder/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.5;

vertices        
(
    ( 0.4 -0.4 0) //0
    ( 0.4  0.4 0) //1
    (-0.4  0.4 0) //2
    (-0.4 -0.4 0) //3

    ( 0.7071068 -0.7071068 0) //4
    ( 0.7071068  0.7071068 0) //5
    (-0.7071068  0.7071068 0) //6
    (-0.7071068 -0.7071068 0) //7

    ( 0.4 -0.4 0.6) //8
    ( 0.4  0.4 0.6) //9
    (-0.4  0.4 0.6) //10
    (-0.4 -0.4 0.6) //11

    ( 0.7071068 -0.7071068 0.6) //12
    ( 0.7071068  0.7071068 0.6) //13
    (-0.7071068  0.7071068 0.6) //14
    (-0.7071068 -0.7071068 0.6) //15
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (30 30 1) simpleGrading (1 1 1)
    hex (4 5 1 0 12 13 9 8) (30 30 1) simpleGrading (1 1 1)
    hex (5 6 2 1 13 14 10 9) (30 30 1) simpleGrading (1 1 1)
    hex (2 6 7 3 10 14 15 11) (30 30 1) simpleGrading (1 1 1)
    hex (4 0 3 7 12 8 11 15) (30 30 1) simpleGrading (1 1 1)
);

edges           
(
    arc 4 5 (1 0 0)
    arc 13 12 (1 0 0.6)
    arc 5 6 (0 1 0)
    arc 14 13 (0 1 0.6)
    arc 6 7 (-1 0 0)
    arc 15 14 (-1 0 0.6)
    arc 7 4 (0 -1 0)
    arc 12 15 (0 -1 0.6)
);

patches         
(
    wall cylinder
    (
        (12 13 5 4)
        (13 14 6 5)
        (14 15 7 6)
        (15 12 4 7)
    )
    empty frontAndBack 
    (
        (3 2 1 0)
        (0 1 5 4)
        (1 2 6 5)
        (2 3 7 6)
        (3 0 4 7)

        (9 10 11 8)
        (13 9 8 12)
        (14 10 9 13)
        (15 11 10 14)
        (12 8 11 15)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
